# Pandas

In [8]:
import numpy as np
import pandas as pd

In [10]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [8]:
import numpy as np
import pandas as pd
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
pass_data = pd.DataFrame(data)

#### 1. Вывести информацию о датафрейме.

In [9]:
pass_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [10]:
pass_data.head(3)

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [12]:
pass_data.filter(items = ['animal', 'age'])

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [13]:
pass_data.loc[[3,4,8], 'animal']

3    dog
4    dog
8    dog
Name: animal, dtype: object

In [14]:
pass_data.loc[[3,4,8], 'age']

3    NaN
4    5.0
8    7.0
Name: age, dtype: float64

#### 5. Выберите строки где количество посещений больше 3.

In [15]:
pass_data.loc[pass_data.visits > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [16]:
pass_data.loc[pass_data['age'] == np.nan]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [19]:
pass_data[(pass_data.age < 3) & (pass_data.animal == 'cat')]

  animal  age  visits priority
0    cat  2.5       1      yes
5    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [20]:
pass_data[(pass_data.age >= 2) & (pass_data.age <= 4)]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
5    cat  2.0       3       no
9    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [41]:
pass_data.at['f','age'] = 1.5
pass_data.age

0    2.5
1    3.0
2    0.5
3    NaN
4    5.0
5    2.0
6    4.5
7    NaN
8    7.0
9    3.0
f    1.5
Name: age, dtype: float64

#### 10. Рассчитать общее количество всех посещений.

In [25]:
pd.to_numeric(pass_data['visits'], errors= 'coerce').sum()

19

#### 11. Расчитайте суммарный возраст животных

In [24]:
pd.to_numeric(pass_data['age'], errors='coerce').sum()

27.5

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [28]:
df = pd.DataFrame(data)
df.loc[10] = {'animal': 'q', 'age': 19, 'visits': 100, 'priority': 'no'}
df.drop([10], inplace=True)

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [29]:
df.set_index(['animal','age']).count(level='animal')

        visits  priority
animal
cat          4         4
dog          4         4
snake        2         2

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [30]:
df.sort_values(by=['age'])
df.sort_values(by=['visits'])

  animal  age  visits priority
0    cat  2.5       1      yes
6  snake  4.5       1       no
7    cat  NaN       1      yes
9    dog  3.0       1       no
2  snake  0.5       2       no
4    dog  5.0       2       no
8    dog  7.0       2       no
1    cat  3.0       3      yes
3    dog  NaN       3      yes
5    cat  2.0       3       no

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [31]:
df.loc[df['priority'] == 'no', 'priority'] = 'yes'
print(df)

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2      yes
3    dog  NaN       3      yes
4    dog  5.0       2      yes
5    cat  2.0       3      yes
6  snake  4.5       1      yes
7    cat  NaN       1      yes
8    dog  7.0       2      yes
9    dog  3.0       1      yes

#### 16. В столбце «animal» измените записи «snake» на «python».

In [33]:
df.loc[df['animal'] == 'snake', 'animal'] = 'python'

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [35]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.drop_duplicates()

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [36]:
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = list('abcdefghij'))
print(df)
min(df[df.columns].sum())

          a         b         c         d         e         f         g  \
0  0.966550  0.584200  0.705245  0.410842  0.888332  0.391139  0.108602
1  0.503571  0.159351  0.211251  0.964189  0.910241  0.657711  0.851692
2  0.777098  0.352292  0.972642  0.865407  0.766781  0.097023  0.677722
3  0.818384  0.035809  0.081421  0.291855  0.106551  0.799607  0.069717
4  0.601755  0.849059  0.719029  0.202681  0.249042  0.679440  0.313674

          h         i         j
0  0.940855  0.730111  0.133827
1  0.221943  0.296638  0.693442
2  0.781664  0.224082  0.338987
3  0.358709  0.318329  0.748524
4  0.917781  0.787744  0.975981

1.9807103364085892

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [37]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
df.fillna(df['value'].sum()/df['value'].count())

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [39]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
new_df = df['From_To'].str.split('_',expand=True)
new_df.columns=['From','To']
final_df = pd.concat([df,new_df],axis=1)
final_df = final_df.drop('From_To',axis=1)
final_df['From'].str.lower()
final_df['To'].str.lower()
print(final_df)

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1           NaN            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3           NaN          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn